Revit 2016 API
PointLoad.Force Property
 Returns the three dimensional force applied to the point load.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Syntax
C#
[ObsoleteAttribute("This property is deprecated in Revit 2016. Use ForceVector instead.")]
public XYZ Force { get; set; }
Visual Basic
<ObsoleteAttribute("This property is deprecated in Revit 2016. Use ForceVector instead.")> _
Public Property Force As XYZ
	Get
	Set
Visual C++
[ObsoleteAttribute(L"This property is deprecated in Revit 2016. Use ForceVector instead.")]
public:
property XYZ^ Force {
	XYZ^ get ();
	void set (XYZ^ value);
}
Remarks
 The default force unit is kN for metric, and kip for imperial.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was NULL
See Also
PointLoad Class
Autodesk.Revit.DB.Structure Namespace